# -*- coding: utf-8 -*-

# https://zhuanlan.zhihu.com/p/390502214
# https://suanming.xuenb.com/nayin/


# 十天干五行表
tgwx = {
    '甲': '阳木',
    '乙': '阴木',
    '丙': '阳火',
    '丁': '阴火',
    '戊': '阳土',
    '己': '阴土',
    '庚': '阳金',
    '辛': '阴金',
    '壬': '阳水',
    '癸': '阴水'
}

# 十二地支五行表
dzwx = {
    '子': '阳水',
    '丑': '阴土',
    '寅': '阳木',
    '卯': '阴木',
    '辰': '阳土',
    '巳': '阴火',
    '午': '阳火',
    '未': '阴土',
    '申': '阳金',
    '酉': '阴金',
    '戌': '阳土',
    '亥': '阴水'
}

# 天干地支六十甲子纳音五行表
tgdznywx = {
    '甲子': '海中金',
    '乙丑': '海中金',
    '丙寅': '炉中火',
    '丁卯': '炉中火',
    '戊辰': '大林木',
    '己巳': '大林木',
    '庚午': '路旁土',
    '辛未': '路旁土',
    '壬申': '剑锋金',
    '癸酉': '剑锋金',
    '甲戌': '山头火',
    '乙亥': '山头火',
    '丙子': '漳下水',
    '丁丑': '漳下水',
    '戊寅': '城头土',
    '己卯': '城头土',
    '庚辰': '白腊金',
    '辛巳': '白腊金',
    '壬午': '杨柳木',
    '癸未': '杨柳木',
    '甲申': '泉中水',
    '乙酉': '泉中水',
    '丙戌': '屋上土',
    '丁亥': '屋上土',
    '戊子': '霹雳火',
    '己丑': '霹雳火',
    '庚寅': '松柏木',
    '辛卯': '松柏木',
    '壬辰': '长流水',
    '癸巳': '长流水',
    '甲午': '砂石金',
    '乙未': '砂石金',
    '丙申': '山下火',
    '丁酉': '山下火',
    '戊戌': '平地木',
    '己亥': '平地木',
    '庚子': '壁上土',
    '辛丑': '壁上土',
    '壬寅': '金箔金',
    '癸卯': '金箔金',
    '甲辰': '覆灯火',
    '乙巳': '覆灯火',
    '丙午': '天河水',
    '丁未': '天河水',
    '戊申': '大驿土',
    '己酉': '大驿土',
    '庚戌': '钗钏金',
    '辛亥': '钗钏金',
    '壬子': '桑柘木',
    '癸丑': '桑柘木',
    '甲寅': '太溪水',
    '乙卯': '太溪水',
    '丙辰': '沙中土',
    '丁巳': '沙中土',
    '戊午': '天上火',
    '己未': '天上火',
    '庚申': '石榴木',
    '辛酉': '石榴木',
    '壬戌': '大海水',
    '癸亥': '大海水'
}









































									
